In [1]:
import pandas as pd
import numpy as np

from sklearn.linear_model import LogisticRegression
from adam_prepare import titanic_pipeline

In [2]:
train, val, test = titanic_pipeline()
train.head()

,survived,age,sibsp,parch,fare,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
748,0,19.0,1,0,53.1000,0,1,1,0,0,0,0,1
45,0,29.0,0,0,8.0500,1,1,0,0,1,0,0,1
28,1,29.0,0,0,7.8792,1,0,0,0,1,0,1,0
633,0,29.0,0,0,0.0000,1,1,1,0,0,0,0,1
403,0,28.0,1,0,15.8500,0,1,0,0,1,0,0,1

In [3]:
def xy_split(df):
    
    return df.drop(columns = ['survived']), df.survived

In [4]:
X_train, y_train = xy_split(train)
X_val, y_val = xy_split(val)

X_train.head()

,age,sibsp,parch,fare,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
748,19.0,1,0,53.1000,0,1,1,0,0,0,0,1
45,29.0,0,0,8.0500,1,1,0,0,1,0,0,1
28,29.0,0,0,7.8792,1,0,0,0,1,0,1,0
633,29.0,0,0,0.0000,1,1,1,0,0,0,0,1
403,28.0,1,0,15.8500,0,1,0,0,1,0,0,1

In [5]:
(y_train == 0).mean()

0.6163723916532905

## Create a model that includes only age, fare, and pclass. Does this model perform better than your baseline?

yes it performs better than the baseline

In [6]:
def xy_split(df):
    
    return df.drop(columns = ['survived','sibsp', 'parch', 'alone', 'sex_male', 'embark_town_Cherbourg', 'embark_town_Queenstown', 'embark_town_Southampton' ]), df.survived

In [7]:
X_train, y_train = xy_split(train)
X_val, y_val = xy_split(val)

X_train.head()

      age     fare  class_First  class_Second  class_Third
748  19.0  53.1000            1             0            0
45   29.0   8.0500            0             0            1
28   29.0   7.8792            0             0            1
633  29.0   0.0000            1             0            0
403  28.0  15.8500            0             0            1

In [8]:
seed = 42

logreg = LogisticRegression(random_state = seed, max_iter = 400)

logreg.fit(X_train, y_train)

logreg.score(X_train, y_train), logreg.score(X_val, y_val)

(0.7142857142857143, 0.7164179104477612)

In [9]:
logreg.coef_

array([[-0.03829218,  0.00834182,  0.75538928,  0.11738762, -0.87374322]])

In [10]:
pd.DataFrame({'feature': X_train.columns,
              'coefficient': logreg.coef_[0]})

        feature  coefficient
0           age    -0.038292
1          fare     0.008342
2   class_First     0.755389
3  class_Second     0.117388
4   class_Third    -0.873743

## Include sex in your model as well. Note that you'll need to encode or create a dummy variable of this feature before including it in a model.

In [11]:
def xy_split(df):
    
    return df.drop(columns = ['survived','sibsp', 'parch', 'alone', 'embark_town_Cherbourg', 'embark_town_Queenstown', 'embark_town_Southampton' ]), df.survived

In [12]:
X_train, y_train = xy_split(train)
X_val, y_val = xy_split(val)

X_train.head()

      age     fare  sex_male  class_First  class_Second  class_Third
748  19.0  53.1000         1            1             0            0
45   29.0   8.0500         1            0             0            1
28   29.0   7.8792         0            0             0            1
633  29.0   0.0000         1            1             0            0
403  28.0  15.8500         1            0             0            1

In [13]:
seed = 42

logreg = LogisticRegression(random_state = seed, max_iter = 400)

logreg.fit(X_train, y_train)

logreg.score(X_train, y_train), logreg.score(X_val, y_val)

(0.8041733547351525, 0.8208955223880597)

In [14]:
logreg.coef_

array([[-3.60726405e-02,  2.07767680e-03, -2.48763174e+00,
         1.05092107e+00, -2.72729153e-03, -1.04826634e+00]])

In [15]:
pd.DataFrame({'feature': X_train.columns,
              'coefficient': logreg.coef_[0]})

        feature  coefficient
0           age    -0.036073
1          fare     0.002078
2      sex_male    -2.487632
3   class_First     1.050921
4  class_Second    -0.002727
5   class_Third    -1.048266

## Try out other combinations of features and models.

## Use you best 3 models to predict and evaluate on your validate sample.

## Choose you best model from the validation performation, and evaluate it on the test dataset. How do the performance metrics compare to validate? to train?